public/IT/Docwriting/Sysanalyses/Notation/UML/Deployment/README.md
```
flowchart TB
    subgraph ClientNode["Клиент"]
        Browser["«artifact»<br>Браузер"]
    end
    subgraph AppServerNode["Сервер приложений"]
        AppServer["«component»<br>Application Server"]
        Backend["«artifact»<br>backend.jar"]
    end
    Database[("«database»<br>PostgreSQL")]

    Browser -->|HTTPS| AppServer
    AppServer --> Backend
    AppServer --> Database
```
